# 09. 데이터 병합하기(Union)

In [ ]:
# pd.concat( [a01Sellout, a02Sellout] , axis = 0 )
# axis = 0은 상하, axis = 1은 좌우로 합친다

In [1]:
import pandas as pd

In [2]:
import warnings
warnings.filterwarnings(action="ignore")

In [3]:
joinSellout = pd.read_csv("../dataset/join_kopo_product_volume.csv")
joinSellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [4]:
a01Sellout = joinSellout[joinSellout.REGIONID=="A01"]
a01Sellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500

In [5]:
a02Sellout = joinSellout[joinSellout.REGIONID=="A02"]
a02Sellout

  REGIONID PRODUCT  YEARWEEK   QTY
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [6]:
# REGIONID가 A01인 데이터의 QTY에는 1.5배를 해주고, A02인 데이터의 QTY에는 0.5배를 해준다.

In [7]:
a01Sellout["QTY"] = a01Sellout.QTY*1.5

In [8]:
a02Sellout["QTY"] = a02Sellout.QTY*0.5

In [9]:
a01Sellout

  REGIONID PRODUCT  YEARWEEK     QTY
0      A01  ST0001    201901  4500.0
1      A01  ST0001    201902  5250.0

In [10]:
a02Sellout

  REGIONID PRODUCT  YEARWEEK     QTY
2      A02  ST0002    201901  2000.0
3      A02  ST0003    201902  3500.0

In [11]:
# 로직을 분리하여 적용한 두 데이터를 합치기
# 컬럼명이 동일한 경우에는 pd.concat을 이용하면 된다.

## 컬럼명이 같은 경우

In [12]:
result = pd.concat( [a01Sellout, a02Sellout] , axis = 0 ) # axis = 0은 상하, axis = 1은 좌우로 합친다
result

  REGIONID PRODUCT  YEARWEEK     QTY
0      A01  ST0001    201901  4500.0
1      A01  ST0001    201902  5250.0
2      A02  ST0002    201901  2000.0
3      A02  ST0003    201902  3500.0

### cf) 컬럼명이 다른 경우, concat을 사용하지 않기

In [13]:
a02Sellout.rename(columns={"PRODUCT" : "PRODUCTGROUP"}, inplace=True)

In [14]:
pd.concat( [a01Sellout, a02Sellout] , axis = 0 )

  REGIONID PRODUCT  YEARWEEK     QTY PRODUCTGROUP
0      A01  ST0001    201901  4500.0          NaN
1      A01  ST0001    201902  5250.0          NaN
2      A02     NaN    201901  2000.0       ST0002
3      A02     NaN    201902  3500.0       ST0003